#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t broken-links:nil
#+options: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:t title:t toc:nil
#+options: todo:t |:t
#+title: Udemy course RDF and SPARQL
#+date: <2022-05-18 Wed>
#+author: Gregory Grubbs
#+email: gregory.grubbs@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.1.50 (Org mode 9.5.3)
#+cite_export:
#+setupfile: ~/projects/emacs/org-html-themes/org/theme-readtheorg-local.setup
#+startup: overview
* DONE Started Complete Udemy course RDF and SPARQL
  :LOGBOOK:
  - State "DONE"       from              [2022-06-01 Wed 08:26]
  CLOCK: [2022-05-16 Mon 14:32]--[2022-05-16 Mon 17:55] =>  3:23
  CLOCK: [2022-05-15 Sun 19:15]--[2022-05-15 Sun 19:25] =>  0:10
  CLOCK: [2022-05-15 Sun 18:00]--[2022-05-15 Sun 19:14] =>  1:14
  CLOCK: [2022-05-15 Sun 08:30]--[2022-05-15 Sun 09:30] =>  1:00
  - State "STARTED"    from "TODO"       [2022-05-14 Sat 16:27]
  CLOCK: [2022-05-14 Sat 16:27]--[2022-05-14 Sat 18:11] =>  1:44
  CREATED: [2022-05-14 Sat 16:26]
  :END:

  + ref https://www.udemy.com/course/rdf-and-sparql-essentials/learn/lecture/25429978
  + RDF: Resource Description Framework
  + this course does *not* cover
    + web ontology language
    + blank nodes
    + graph visualizations or the building of knowledge graph applications
  + "triple" and "statement" are interchangeable terms
  + in RDF, nodes cannot exist by themselves, without edges
  + There are 3 kinds of nodes in RDF
    + IRI (Internationalized Resource Identifier)
      + uniquely identify entities in a graph
    + Literal
      + plain data values like strings, integers, dates etc
      + can indicate a data type defined in the XML Schema Datatypes (XSD)
        #+begin_example
          "1980-08-26"^^xsd:date
        #+end_example
    + Blank node
      + avoid if possible - they don't carry persistent labels and make querying RDF data
        more difficult
    + Blazegraph is used in course
